# All About Feature Transformation Techniques :-)

In [1]:
import pandas as pd 
import seaborn as sns

In [2]:
df = pd.read_csv("supershops.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# MinMaxScalling / Normalization

In [3]:
from sklearn.preprocessing import MinMaxScaler

In [4]:
mms = MinMaxScaler()#creating object for MinMaxScaler

In [5]:
mms_fit = mms.fit(df[["Marketing Spend"]]) #fit/train
mms_fit

MinMaxScaler()

In [6]:
df['Marketing Spend'] = mms.transform(df[["Marketing Spend"]])
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [7]:
#at a time fit and transform 
df["Administration"]= mms.fit_transform(df[["Administration"]])
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

# Standard Scalling

In [8]:
df2 = pd.read_csv("supershops.csv") #Read CSV file 
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
from sklearn.preprocessing import StandardScaler #Import Standard Scaler

In [10]:
ss = StandardScaler() #Creating Object for Standard Scaler

In [11]:
ss_fit = ss.fit(df2[["Marketing Spend"]])
ss_fit

StandardScaler()

In [12]:
df2["Marketing Spend"] = ss.transform(df2[["Marketing Spend"]])
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913       136897.80  471784.10    Dhaka  192261.83
1         1.955860       151377.59  443898.53      Ctg  191792.06
2         1.754364       101145.55  407934.54  Rangpur  191050.39
3         1.554784       118671.85  383199.62    Dhaka  182901.99
4         1.504937        91391.77  366168.42  Rangpur  166187.94

In [13]:
#At a time fit and transformation
df2["Administration"]= ss.fit_transform(df2[["Administration"]])
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753  471784.10    Dhaka  192261.83
1         1.955860        1.082807  443898.53      Ctg  191792.06
2         1.754364       -0.728257  407934.54  Rangpur  191050.39
3         1.554784       -0.096365  383199.62    Dhaka  182901.99
4         1.504937       -1.079919  366168.42  Rangpur  166187.94

# Robust Scalling

In [14]:
df3 = pd.read_csv('supershops.csv') #read csv file 
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [15]:
from sklearn.preprocessing import RobustScaler #import Robust Scaler

In [16]:
rs = RobustScaler() # Creating Object for Robust Scaler

In [17]:
rs_fit =rs.fit(df3[["Marketing Spend"]])
rs_fit

RobustScaler()

In [18]:
df3["Marketing Spend"] = rs.transform(df3[["Marketing Spend"]])
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530       136897.80  471784.10    Dhaka  192261.83
1         1.452113       151377.59  443898.53      Ctg  191792.06
2         1.303634       101145.55  407934.54  Rangpur  191050.39
3         1.156567       118671.85  383199.62    Dhaka  182901.99
4         1.119836        91391.77  366168.42  Rangpur  166187.94

In [19]:
#at a time fit and transform
df3["Administration"] = rs.fit_transform(df3[["Administration"]])
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355  471784.10    Dhaka  192261.83
1         1.452113        0.697565  443898.53      Ctg  191792.06
2         1.303634       -0.524290  407934.54  Rangpur  191050.39
3         1.156567       -0.097977  383199.62    Dhaka  182901.99
4         1.119836       -0.761543  366168.42  Rangpur  166187.94

# Max Absolute Scalling

In [20]:
df4 = pd.read_csv("supershops.csv") #Read the CSV file
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [21]:
from sklearn.preprocessing import MaxAbsScaler #Import Max Absolute Scaler

In [22]:
mas = MaxAbsScaler() # Creating Object

In [23]:
mas_fit = mas.fit(df4[["Marketing Spend"]]) # Fit  
mas_fit

MaxAbsScaler()

In [24]:
df4[["Marketing Spend"]] =mas.transform(df4[["Marketing Spend"]]) # Transform
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [25]:
#at a time set and transformation
df4["Administration"] = mas.fit_transform(df4[["Administration"]])
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527  471784.10    Dhaka  192261.83
1         0.983359        0.828805  443898.53      Ctg  191792.06
2         0.927985        0.553781  407934.54  Rangpur  191050.39
3         0.873136        0.649738  383199.62    Dhaka  182901.99
4         0.859438        0.500378  366168.42  Rangpur  166187.94

# Normal Technique

In [26]:
df5 = pd.read_csv("supershops.csv")
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [27]:
df5.Administration

0     136897.80
1     151377.59
2     101145.55
3     118671.85
4      91391.77
5      99814.71
6     147198.87
7     145530.06
8     148718.95
9     108679.17
10    110594.11
11     91790.61
12    127320.38
13    135495.07
14    156547.42
15    122616.84
16    121597.55
17    145077.58
18    114175.79
19    153514.11
20    113867.30
21    153773.43
22    122782.75
23    105751.03
24     99281.34
25    139553.16
26    144135.98
27    127864.55
28    182645.56
29    153032.06
30    115641.28
31    152701.92
32    129219.61
33    103057.49
34    157693.92
35     85047.44
36    127056.21
37     51283.14
38     65947.93
39     82982.09
40    118546.05
41     84710.77
42     96189.63
43    127382.30
44    154806.14
45    124153.04
46    115816.21
47    135426.92
48     51743.15
49    116983.80
Name: Administration, dtype: float64

In [28]:
maximum = df5.Administration.max()
maximum

182645.56

In [29]:
df5.Administration = df5.Administration / maximum
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.749527  471784.10    Dhaka  192261.83
1        162597.70        0.828805  443898.53      Ctg  191792.06
2        153441.51        0.553781  407934.54  Rangpur  191050.39
3        144372.41        0.649738  383199.62    Dhaka  182901.99
4        142107.34        0.500378  366168.42  Rangpur  166187.94

In [30]:
df5.Administration.std()

0.15339985683467303

In [31]:
df5.Administration.var()

0.02353151607689818

In [32]:
df5.Administration.mean()

0.6643722387776632

In [33]:
df5.Administration.median()

0.6717918300340835

# Thank You! :-)